app/controllers/home_controller.rb

  def venda
    user = Usuario.find(session[:usuario_id])
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1